app/new_crawler_b/app/controllers/crawler_controller.rb

SELECT  `emails`.* FROM `emails` LIMIT 10
---
  def index
    @emails = Email.take(10)

SELECT `urls`.* FROM `urls`
---
  def search
    urls = Url.all