app/new_crawler_b/app/controllers/emails_controller.rb

SELECT  `emails`.* FROM `emails` LIMIT 10
---
  def index
    @emails = Email.take(10)